# Pandas

### Q1) Create a dictionary with column names- empid, empname, sal, DOJ. Put this into a dataframe and display the rows in reverse order.
* Retrieve maximum and minimum salary
* Display the empid and empname whose salary is greater than 20000
* Sort the rows based on the alphabetical order based on empname

In [64]:
dict={'empid':[10,20,30],'empname':['Arthi', 'Deepika','Sasi'],'sal':[10000,25000,40000],'DOJ':['25-2-2018','2-10-2019','3-5-2018']}
dict
import pandas as pd
data1=pd.DataFrame(dict)
data1

   empid  empname    sal        DOJ
0     10    Arthi  10000  25-2-2018
1     20  Deepika  25000  2-10-2019
2     30     Sasi  40000   3-5-2018

In [65]:
data1.iloc[::-1] #Reverse Order

   empid  empname    sal        DOJ
2     30     Sasi  40000   3-5-2018
1     20  Deepika  25000  2-10-2019
0     10    Arthi  10000  25-2-2018

In [66]:
#Maximum salary
data1[data1.sal == data1.sal.max()]

   empid empname    sal       DOJ
2     30    Sasi  40000  3-5-2018

In [67]:
#Minimum Salary
data1[data1.sal == data1.sal.min()]

   empid empname    sal        DOJ
0     10   Arthi  10000  25-2-2018

In [68]:
data1.sal = data1.sal>10000
data1[['empid','empname','sal']]

   empid  empname    sal
0     10    Arthi  False
1     20  Deepika   True
2     30     Sasi   True

In [69]:
#Sorting based on ascending order
data1.sort_values(by='empname')

   empid  empname    sal        DOJ
0     10    Arthi  False  25-2-2018
1     20  Deepika   True  2-10-2019
2     30     Sasi   True   3-5-2018

In [70]:
#Sorting based on descending order
data1.sort_values(by='empname',ascending=False)

   empid  empname    sal        DOJ
2     30     Sasi   True   3-5-2018
1     20  Deepika   True  2-10-2019
0     10    Arthi  False  25-2-2018

### Q2) Create a dataframe with 4 columns and 5 rows(leave some empty values),check for null values and fill the values of nan with 100.

In [25]:
import pandas as pd
dic = {'one':[1,2,np.nan,4,np.nan],
            'two':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'three':[11,12,13,14,15],
            'four':[16,np.nan,18,19,20]}
dic
data=pd.DataFrame(dic)
data

   one  two  three  four
0  1.0  NaN     11  16.0
1  2.0  NaN     12   NaN
2  NaN  NaN     13  18.0
3  4.0  NaN     14  19.0
4  NaN  NaN     15  20.0

In [26]:
data.isnull()

     one   two  three   four
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [27]:
data.isnull().sum()

one      2
two      5
three    0
four     1
dtype: int64

In [28]:
data.fillna(value=100)

     one    two  three   four
0    1.0  100.0     11   16.0
1    2.0  100.0     12  100.0
2  100.0  100.0     13   18.0
3    4.0  100.0     14   19.0
4  100.0  100.0     15   20.0